In [3]:
import pandas as pd
data = {
'mass': [1.482e23, 1.076e23, 8.932e22, 4.800e22, 7.342e22],
'radius': [2.634e6, None , 1.822e6, None , 1.737e6],
'parent': ['Jupiter', 'Jupiter', 'Jupiter', 'Jupiter', 'Earth']
}
index = ['Ganymede', 'Callisto', 'Io', 'Europa', 'Moon']

In [5]:
df = pd.DataFrame(data=data, index=index)
df

                  mass     radius   parent
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [6]:
df.dropna()

                  mass     radius   parent
Ganymede  1.482000e+23  2634000.0  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [8]:
df.isnull()

           mass  radius  parent
Ganymede  False   False   False
Callisto  False    True   False
Io        False   False   False
Europa    False    True   False
Moon      False   False   False

In [9]:
df.isna()

           mass  radius  parent
Ganymede  False   False   False
Callisto  False    True   False
Io        False   False   False
Europa    False    True   False
Moon      False   False   False

In [13]:
df.fillna(0.00)

                  mass     radius   parent
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        0.0  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        0.0  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [15]:
# rename row the default
df.rename({'Io':'Africa'})

                  mass     radius   parent
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Africa    8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [17]:
df.rename({'parent': 'Ancestose'}, axis='columns')

                  mass     radius Ancestose
Ganymede  1.482000e+23  2634000.0   Jupiter
Callisto  1.076000e+23        NaN   Jupiter
Io        8.932000e+22  1822000.0   Jupiter
Europa    4.800000e+22        NaN   Jupiter
Moon      7.342000e+22  1737000.0     Earth

In [26]:
df['mass'][2]

5.6e+35

In [27]:
df['mass']['Io']

5.6e+35

In [36]:
print(df.loc['Moon'], end='')

mass      73419999999999996854272.0
radius                    1737000.0
parent                        Earth
Name: Moon, dtype: object

In [38]:
df.loc['Europa', ['mass', 'radius']]

mass      48000000000000000000000.0
radius                          NaN
Name: Europa, dtype: object